In [1]:
import pandas as pd
import numpy as np




import warnings
warnings.filterwarnings('ignore')  # esto es para quitar prints

pd.set_option('display.max_columns', None)   # mostrar todas las columnas del df
pd.set_option('display.max_rows', None)   # mostrar todas las filas del df

In [2]:
from sqlalchemy import create_engine

str_conn='mysql+pymysql://root:ironhack@localhost:3306' #Conectar al servidor

cursor=create_engine(str_conn) #Cursor que apunta al servidor

# cursor.execute('drop database if exists videos;') #Lanzar query en el servidor, borra SCHEMA si existe

# cursor.execute('create database SCHEMA;') #Crear SCHEMA

str_conn='mysql+pymysql://root:ironhack@localhost:3306/videos' #Conexión a SCHEMA

cursor_db=create_engine(str_conn) #Cursor que apunta a SCHEMA

#DATAFRAME.to_sql(name='NOMBRE_DATAFRAME', con=cursor_db, if_exists='replace', index=False)

1 - NÚMERO DE PELICULAS POR CATEGORÍA

In [3]:
query='''

SELECT x.name, COUNT(x.name) as Num_pelis
FROM (
SELECT c.name 
FROM categories c
LEFT JOIN films f ON c.category_id = f.category_id
) as x
GROUP BY x.name
ORDER BY Num_pelis DESC;

'''

df_sql1=pd.read_sql(query, cursor_db)

df_sql1

           name  Num_pelis
0     Animation         50
1        Sports         46
2        Horror         45
3           New         45
4   Documentary         44
5        Action         43
6         Drama         40
7       Foreign         40
8      Classics         38
9        Sci-Fi         36
10       Family         34
11     Children         32
12       Comedy         32
13       Travel         32
14        Music         31
15        Games         26

In [5]:
df_sql1.Num_pelis.sum()

614

2 - 5 PRIMEROS ACTORES CON MÁS PELÍCULAS

In [6]:
query='''

SELECT x.ACTOR, COUNT(x.film_id) as Num_pelis
FROM (
SELECT CONCAT(a.first_name, ' ', a.last_name) as ACTOR, a.actor_id, o.film_id
FROM actores a
LEFT JOIN oldHDD o ON a.actor_id = o.actor_id
) as x
GROUP BY x.actor_id
ORDER BY Num_pelis DESC
LIMIT 5;

'''

df_sql2=pd.read_sql(query, cursor_db)

df_sql2

           ACTOR  Num_pelis
0  SANDRA KILMER         37
1     VAL BOLGER         35
2       UMA WOOD         35
3  JULIA MCQUEEN         33
4   RIP CRAWFORD         33

3 - PELIS DE ACCION O CIENCIA FICCION PARA TODOS LOS PUBLICOS QUE DUREN MENOS DE UNA HORA Y MEDIA

In [7]:
query='''

SELECT f.title, f.length, c.name as categoria, f.rating   
from films f
LEFT JOIN categories c ON f.category_id = c.category_id
WHERE c.name in ('Sci-Fi', 'Action') AND f.length < 90 AND f.rating = 'G';

'''

df_sql3=pd.read_sql(query, cursor_db)

df_sql3

                    title  length categoria rating
0          EXCITEMENT EVE      51    Action      G
1       MIDNIGHT WESTWARD      86    Action      G
2           PRIMARY GLASS      53    Action      G
3     RINGS HEARTBREAKERS      58    Action      G
4                SIDE ARK      52    Action      G
5  WATERFRONT DELIVERANCE      61    Action      G
6           WEREWOLF LOLA      79    Action      G
7           CHEAPER CLYDE      87    Sci-Fi      G
8     COLDBLOODED DARLING      70    Sci-Fi      G
9         DAISY MENAGERIE      84    Sci-Fi      G

4 - LA MEDIA DE DURACIÓN DE LAS PELIS DE ANIMACIÓN Y NIÑOS

In [8]:
query='''

SELECT z.categoria, AVG(z.length) as Media_duracion
FROM (
SELECT  f.length, c.name as categoria   
from films f
LEFT JOIN categories c ON f.category_id = c.category_id
WHERE c.name in ('Animation', 'Children')
) as z
GROUP BY z.categoria;

'''

df_sql4=pd.read_sql(query, cursor_db)

df_sql4

   categoria  Media_duracion
0  Animation        113.9800
1   Children        106.1563

5 - LAS 15 PELIS MÁS ALQUILADAS

In [9]:
query='''

SELECT f.title, y.Num_alquileres
FROM (
SELECT z.film_id, COUNT(*) Num_alquileres
FROM (
SELECT i.film_id 
from rental r
LEFT JOIN inventory i ON r.inventory_id = i.inventory_id
) as z
GROUP BY z.film_id 
) as y
LEFT JOIN films f  ON f.film_id = y.film_id
ORDER BY y.Num_alquileres DESC
LIMIT 15

'''

df_sql5=pd.read_sql(query, cursor_db)

df_sql5

                     title  Num_alquileres
0            BOOGIE AMELIE               4
1              ANTHEM LUKE               3
2           CANDLES GRAPES               3
3       BUCKET BROTHERHOOD               3
4           BINGO TALENTED               3
5     BARBARELLA STREETCAR               3
6              CLOSER BANG               3
7          CENTER DINOSAUR               3
8       BUTTERFLY CHOCOLAT               3
9     CHICKEN HELLFIGHTERS               3
10  CONFIDENTIAL INTERVIEW               3
11           COAST RAINBOW               3
12           CHEAPER CLYDE               3
13          CELEBRITY HORN               3
14        AFFAIR PREJUDICE               2

6 - PELI Y LISTA DE ACTORES QUE PARTICIPAN, DONDE HAYA MÁS DE 4 ACTORES

In [10]:
query='''

SELECT z.title, COUNT(actor) as N_actores, GROUP_CONCAT(z.actor) as atores
FROM (
SELECT f.title, CONCAT(a.first_name, ' ', a.last_name) as actor
FROM oldHDD o
LEFT JOIN films f ON o.film_id = f.film_id
LEFT JOIN actores a ON a.actor_id = o.actor_id
) as z
GROUP BY z.title
HAVING N_actores > 4
;

'''

df_sql6=pd.read_sql(query, cursor_db)

df_sql6

,title,N_actores,atores
0,BOONDOCK BALLROOM,6,"ED CHASE,FRED COSTNER,JENNIFER DAVIS,KIRSTEN P..."
1,CHITTY LOCK,5,"ELVIS MARX,JOHNNY LOLLOBRIGIDA,LUCILLE TRACY,S..."
2,CONEHEADS SMOOCHY,5,"ALEC WAYNE,AUDREY OLIVIER,DAN TORN,JOHNNY LOLL..."
3,FLASH WARS,5,"DAN TORN,KIRSTEN PALTROW,MATTHEW JOHANSSON,NIC..."
4,OKLAHOMA JUMANJI,5,"CUBA OLIVIER,JENNIFER DAVIS,KARL BERRY,PENELOP..."
5,STRANGER STRANGERS,5,"AUDREY OLIVIER,HELEN VOIGHT,SANDRA KILMER,TOM ..."

7 - NÚMERO DE EJEMPLARES DE CADA PELÍCULA EN CADA TIENDA Y CUANTAS ESTÁN ALQUILADAS

In [11]:
query='''

SELECT z.film_id, z.title, z.store_id, COUNT(z.store_id) as ejemplares, COUNT(z.rental_id) as alquildas
FROM (
SELECT i.inventory_id, i.film_id, f.title, i.store_id, r.rental_id
FROM inventory i
LEFT JOIN rental r ON r.inventory_id = i.inventory_id
LEFT JOIN films f ON i.film_id = f.film_id
) as z
GROUP BY z.film_id, z.store_id
'''

df_sql7=pd.read_sql(query, cursor_db)

df_sql7.head()

   film_id             title  store_id  ejemplares  alquildas
0        1  ACADEMY DINOSAUR         1           4          1
1        1  ACADEMY DINOSAUR         2           4          1
2        2    ACE GOLDFINGER         2           3          0
3        3  ADAPTATION HOLES         2           4          0
4        4  AFFAIR PREJUDICE         1           4          1

8 - CREAR UAN TABLA TEMPORAL CON LOS ALQUILERES Y UNA NUEVA COLUMNA QUE CALCULE EL TIEMPO DE ALQUILER

In [14]:


sql = '''

create temporary table videos.rental_times

SELECT rental_id, inventory_id, rental_date, return_date, DATEDIFF(return_date,rental_date) as tiempo_entrega  
FROM rental;

'''


cursor_db.execute(sql)

In [15]:
query='''

SELECT  *
FROM rental_times;

'''



df_sql8=pd.read_sql(query, cursor_db)

df_sql8.head()

,rental_id,inventory_id,rental_date,return_date,tiempo_entrega
0,1,367,2005-05-24 22:53:30,2005-05-26 22:04:30,2
1,16,389,2005-05-25 00:43:11,2005-05-26 04:42:11,1
2,17,830,2005-05-25 01:06:36,2005-05-27 00:43:36,2
3,21,146,2005-05-25 01:59:46,2005-05-26 01:01:46,1
4,22,727,2005-05-25 02:19:23,2005-05-26 04:52:23,1

9 - ESTABLECER UNA PENALIZACIÓN SI EL ALQUILER REBASÓ LA DURACIÓN DE ALQUILER ESTABLECIDO POR PELÍCULA CON EL SIGUIENTE CÓDIGO
1 dentro del tiempo alquiler establecido
2 sobrepasa el tiempo de alquiler
ESTOS CÓDIGOS SERÁN UN MULTIPLICADOR DEL PRECIO, ES DECIR, EL QUE SE PASE DEL TIEMPO PAGARÁ EL DOBLE
(utilizaremos la tabla temporal creada en la consulta anterior)

In [16]:
query='''


SELECT z.rental_id, z.inventory_id, z.tiempo_entrega, z.film_id, z.rental_duration, z.rental_rate,
CASE 
    WHEN z.rental_duration - z.tiempo_entrega < 0 THEN 2
    ELSE 1
    END AS penalizacion

FROM (
SELECT r.rental_id, r.inventory_id, r.tiempo_entrega, i.film_id, f.rental_duration, f.rental_rate
FROM rental_times r
LEFT JOIN inventory i ON r.inventory_id = i.inventory_id
LEFT JOIN films f ON i.film_id = f.film_id
) as z

'''



df_sql9=pd.read_sql(query, cursor_db)

df_sql9.head()

,rental_id,inventory_id,tiempo_entrega,film_id,rental_duration,rental_rate,penalizacion
0,1,367,2,80,7,2.99,1
1,16,389,1,86,6,4.99,1
2,17,830,2,181,7,2.99,1
3,21,146,1,31,5,4.99,1
4,22,727,1,159,5,4.99,1

10 - RECAUDACIÓN TOTAL (teniendo en cuenta las penalizaciones definidas en la consulta anterior)

In [17]:
query='''


SELECT SUM(x.rental_rate*x.penalizacion) as recaudacion_total

FROM(

SELECT z.rental_id, z.inventory_id, z.tiempo_entrega, z.film_id, z.rental_duration, z.rental_rate,
CASE 
    WHEN z.rental_duration - z.tiempo_entrega < 0 THEN 2
    ELSE 1
    END AS penalizacion

FROM (
SELECT r.rental_id, r.inventory_id, r.tiempo_entrega, i.film_id, f.rental_duration, f.rental_rate
FROM rental_times r
LEFT JOIN inventory i ON r.inventory_id = i.inventory_id
LEFT JOIN films f ON i.film_id = f.film_id
) as z
) as x


'''



df_sql10=pd.read_sql(query, cursor_db)

df_sql10.head()

   recaudacion_total
0         920.959977